src/main/resources/example3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:car="http://cardlibrary2.webservices.integration.css.aamsystems.com">
    <soapenv:Header/>
    <soapenv:Body>
        <car:addReferenceObject>
            <car:aSession>?</car:aSession>
            <car:aParent>
                <car:children>
                    <!--Zero or more repetitions:-->

                </car:children>
                <car:id>?</car:id>
                <car:label>?</car:label>
                <car:type>?</car:type>
            </car:aParent>
            <car:aType>?</car:aType>
            <car:aLabel>?</car:aLabel>
        </car:addReferenceObject>
    </soapenv:Body>
</soapenv:Envelope>